##Topic 3 - Python Structure & Data Type Assignment

# Data Type Declaration

1. > Create an empty variable (Points : 5)

In [51]:
#Code goes here
x = None
print(x)

None

2. > Create a variable containing your name (Points : 5)

In [41]:
#Code goes here
Name = 'Anindya'
print(Name)

Anindya

3. > Create a list of 5 items you can find in the classroom (Points : 5)

In [42]:
#Code goes here
items = ['table', 'whiteboard', 'chair', 'pencil', 'book']
items

['table', 'whiteboard', 'chair', 'pencil', 'book']

4. > Create a dictionary containing 2 keys and value (Points : 5)

In [43]:
#Code goes here
import pandas as pd
d = {'a': [1, 2], 'b': [3, 4], 'c': [5,6], 'd': [7,8]}
df = pd.DataFrame(d) 
df

   a  b  c  d
0  1  3  5  7
1  2  4  6  8

# Basic Data Operation

You sold 20 pieces of electronics at the price of 12000. The customer gets a total discount of 10%.

Below are those variables:

1.   price=12000
2.   quantity_sold=20
3.   discount=10%


Using Python code, write the code the find the total money that the customer to pay. (Points : 15)

In [45]:
#Code goes here
price = 12000
quantity_sold= 20
discount= 0.1
Buy = price * quantity_sold
Total_Discount = Buy * discount 
Pay = Buy - Total_Discount
print(Pay)

216000.0

# List Data Operation

5. > Follow the instructions in the code blocks

In [44]:
# Create list of countries in the world (total 7 countries) (Points : 5)

#Code goes here
data = { 'Countries' : ['Indonesia', 'Malaysia', 'Thailand', 'Korea Selatan', 'USA', 'Swiss', 'Rusia']}

import pandas as pd
df = pd.DataFrame(data)
df

       Countries
0      Indonesia
1       Malaysia
2       Thailand
3  Korea Selatan
4            USA
5          Swiss
6          Rusia

In [46]:
# Get 4 countries from the first index of the list (Points : 5)

#Code goes here
df.head(4)

       Countries
0      Indonesia
1       Malaysia
2       Thailand
3  Korea Selatan

In [47]:
# Append new country to the list (Points : 5)

#Code goes here
df.append({'Countries' : 'Australia'},ignore_index=True)

C:\Users\ASUS\AppData\Local\Temp\ipykernel_15884\2654480484.py:4: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'Countries' : 'Australia'},ignore_index=True)

       Countries
0      Indonesia
1       Malaysia
2       Thailand
3  Korea Selatan
4            USA
5          Swiss
6          Rusia
7      Australia

In [48]:
# Drop one country from the list (Points : 5)

#Code goes here
df.drop(index=df[df['Countries'] == 'Indonesia'].index)

       Countries
1       Malaysia
2       Thailand
3  Korea Selatan
4            USA
5          Swiss
6          Rusia

In [21]:
# Get country in the last index (Points : 5)
#Code goes here
df.tail(1)

  Countries
6     Rusia

# Dictionary Data Operation

6. >  Follow the instructions below

In [24]:
# Given the dictionary below

customer={
    "name":['Dio','Eka','Wayu','Riki'],
    "age":[20,19,24,39],
    "gender":[1,0,0,1],
    "membership":['Platinum','Gold','Silver','Silver']
}

In [25]:
# Print all keys in customer (Points : 5)

#Code goes here

import pandas as pd
df = pd.DataFrame(customer)
df

   name  age  gender membership
0   Dio   20       1   Platinum
1   Eka   19       0       Gold
2  Wayu   24       0     Silver
3  Riki   39       1     Silver

In [26]:
# Print all customer names (Points : 5)

#Code goes here

df[['name']]

   name
0   Dio
1   Eka
2  Wayu
3  Riki

In [28]:
# Print the first customer name (Points : 5)

#Code goes here
df.loc[0:0,['name']]

  name
0  Dio

In [29]:
# Drop "age" key from the dictionary (Points : 5)

#Code goes here

df.drop('age', axis=1)

   name  gender membership
0   Dio       1   Platinum
1   Eka       0       Gold
2  Wayu       0     Silver
3  Riki       1     Silver

In [30]:
# Replace customer gender list value (Points : 20)
# gender 1 => Male
# gender 0 => Female 


#Code goes here
def gender_to_string(a):
    if a == 0:
        return 'Female'
    if a == 1:
        return 'Male'


df['gender'] = df['gender'].apply(gender_to_string)
df

   name  age  gender membership
0   Dio   20    Male   Platinum
1   Eka   19  Female       Gold
2  Wayu   24  Female     Silver
3  Riki   39    Male     Silver